betamoojw/ESP32_KNX_IP_Lib/esp-knx-ip.h
typedef enum __config_flags
{
  CONFIG_FLAGS_NO_FLAGS = 0,
  CONFIG_FLAGS_VALUE_SET = 1,
} config_flags_t;

typedef struct __message
{
  knx_command_type_t ct;
  address_t received_on;
  uint8_t data_len;
  uint8_t *data;
  address_t source; // Sender's individual address; data is valid only during callback.
} message_t;

typedef bool (*enable_condition_t)(void);
typedef void (*callback_fptr_t)(message_t const &msg, void *arg);
typedef void (*feedback_action_fptr_t)(void *arg);

typedef uint8_t callback_id_t;
typedef uint8_t callback_assignment_id_t;
typedef uint8_t config_id_t;
typedef uint8_t feedback_id_t;

typedef struct __option_entry
{
  char *name;
  uint8_t value;
} option_entry_t;

typedef struct __config
{
  config_type_t type;
  String name;
  uint8_t offset;
  uint8_t len;
  enable_condition_t cond;
  union {
    option_entry_t *options;
  } data;
} config_t;

typedef struct __feedback_float_options
{
  uint8_t precision;
} feedback_float_options_t;

typedef struct __feedback_action_options
{
  void * arg;
} feedback_action_options_t;

typedef struct __feedback
{
  feedback_type_t type;
  String name;
  enable_condition_t cond;
  void *data;
  union {
    feedback_float_options_t float_options;
    feedback_action_options_t action_options;
  } options;
} feedback_t;

typedef struct __callback
{
  callback_fptr_t fkt;
  enable_condition_t cond;
  void *arg;
  String name;
} callback_t;

typedef struct __callback_assignment
{
  address_t address;
  callback_id_t callback_id;
} callback_assignment_t;

class ESPKNXIP {
  public:
    ESPKNXIP();
    void load();
    void start();
    // Immediate local cleanup after network loss; use disconnect_tunnel() for graceful teardown.
    void stop();
    void loop();
    // Checked application-client APIs. Call loop() regularly for tunnel timers.
    knxip::Result start_routing();
    knxip::Result start_tunnel(IPAddress server, uint16_t port = 3671, uint16_t local_port = 3672, bool nat = false);
    knxip::Result disconnect_tunnel();
    knxip::Tunnel::State tunnel_state() const { return tunnel.state(); }
    uint16_t tunnel_address() const { return tunnel.address(); }
    uint8_t tunnel_status() const { return tunnel.lastStatus(); }
    bool tunnel_pending() const { return tunnel.pending(); }
    knxip::Result last_result() const { return last_result_; }
    knxip::Result send_checked(address_t const &receiver, knx_command_type_t ct, size_t data_len, const uint8_t *data);
    // payload excludes APCI. compact=true only for DPTs occupying <=6 bits.
    knxip::Result send_payload(address_t const &receiver, knx_command_type_t ct, const uint8_t *payload, size_t size, bool compact = false);
    // Validates a supported main-type layout; does not infer/validate a subtype.
    knxip::Result send_dpt(address_t const &receiver, knx_command_type_t ct, uint16_t main_type, const uint8_t *payload, size_t size);
    static knxip::Result message_payload(const message_t &message, uint16_t main_type, const uint8_t *&payload, size_t &size);
    typedef void (*discovery_callback_t)(const knxip::DiscoveryView &, void *);
    knxip::Result discover(discovery_callback_t callback, void *arg = nullptr, uint16_t local_port = 3673);
    knxip::Result describe(IPAddress server, discovery_callback_t callback, void *arg = nullptr, uint16_t port = 3671, uint16_t local_port = 3673);
    struct Diagnostics { uint32_t malformed, routing_lost, routing_busy; };
    Diagnostics diagnostics() const { return diagnostics_; }
    void save_to_eeprom();
    void restore_from_eeprom();

    callback_id_t callback_register(String name, callback_fptr_t cb, void *arg = nullptr, enable_condition_t cond = nullptr);
    void          callback_assign(callback_id_t id, address_t val);
    void          callback_unassign(callback_id_t id, address_t val);

    void          physical_address_set(address_t const &addr);
    address_t     physical_address_get();

    // Configuration functions
    config_id_t   config_register_string(String name, uint8_t len, String _default, enable_condition_t cond = nullptr);
    config_id_t   config_register_int(String name, int32_t _default, enable_condition_t cond = nullptr);
    config_id_t   config_register_bool(String name, bool _default, enable_condition_t cond = nullptr);
    config_id_t   config_register_options(String name, option_entry_t *options, uint8_t _default, enable_condition_t cond = nullptr);
    config_id_t   config_register_ga(String name, enable_condition_t cond = nullptr);

    String        config_get_string(config_id_t id);
    int32_t       config_get_int(config_id_t id);
    bool          config_get_bool(config_id_t id);
    uint8_t       config_get_options(config_id_t id);
    address_t     config_get_ga(config_id_t id);

    void          config_set_string(config_id_t id, String val);
    void          config_set_int(config_id_t id, int32_t val);
    void          config_set_bool(config_id_t, bool val);
    void          config_set_options(config_id_t id, uint8_t val);
    void          config_set_ga(config_id_t id, address_t const &val);

    // Feedback functions
    feedback_id_t feedback_register_int(String name, int32_t *value, enable_condition_t cond = nullptr);
    feedback_id_t feedback_register_float(String name, float *value, uint8_t precision = 2, enable_condition_t cond = nullptr);
    feedback_id_t feedback_register_bool(String name, bool *value, enable_condition_t cond = nullptr);
    feedback_id_t feedback_register_action(String name, feedback_action_fptr_t value, void *arg = nullptr, enable_condition_t = nullptr);

    // Send functions
    void send(address_t const &receiver, knx_command_type_t ct, uint8_t data_len, uint8_t *data);

    void send_1bit(address_t const &receiver, knx_command_type_t ct, uint8_t bit);
    void send_2bit(address_t const &receiver, knx_command_type_t ct, uint8_t twobit);
    void send_4bit(address_t const &receiver, knx_command_type_t ct, uint8_t fourbit);
    void send_1byte_int(address_t const &receiver, knx_command_type_t ct, int8_t val);
    void send_1byte_uint(address_t const &receiver, knx_command_type_t ct, uint8_t val);
    void send_2byte_int(address_t const &receiver, knx_command_type_t ct, int16_t val);
    void send_2byte_uint(address_t const &receiver, knx_command_type_t ct, uint16_t val);
    void send_2byte_float(address_t const &receiver, knx_command_type_t ct, float val);
    void send_3byte_time(address_t const &receiver, knx_command_type_t ct, uint8_t weekday, uint8_t hours, uint8_t minutes, uint8_t seconds);
    void send_3byte_time(address_t const &receiver, knx_command_type_t ct, time_of_day_t const &time) { send_3byte_time(receiver, ct, time.weekday, time.hours, time.minutes, time.seconds); }
    void send_3byte_date(address_t const &receiver, knx_command_type_t ct, uint8_t day, uint8_t month, uint8_t year);
    void send_3byte_date(address_t const &receiver, knx_command_type_t ct, date_t const &date) { send_3byte_date(receiver, ct, date.day, date.month, date.year); }
    void send_3byte_color(address_t const &receiver, knx_command_type_t ct, uint8_t red, uint8_t green, uint8_t blue);
    void send_3byte_color(address_t const &receiver, knx_command_type_t ct, color_t const &color) { send_3byte_color(receiver, ct, color.red, color.green, color.blue); }
    void send_4byte_int(address_t const &receiver, knx_command_type_t ct, int32_t val);
    void send_4byte_uint(address_t const &receiver, knx_command_type_t ct, uint32_t val);
    void send_4byte_float(address_t const &receiver, knx_command_type_t ct, float val);
    void send_14byte_string(address_t const &receiver, knx_command_type_t ct, const char *val);
    void send_ext(address_t const &receiver);// Neuer READ Helper für externe GAs


    void write_1bit(address_t const &receiver, uint8_t bit) { send_1bit(receiver, KNX_CT_WRITE, bit); }
    void write_2bit(address_t const &receiver, uint8_t twobit) { send_2bit(receiver, KNX_CT_WRITE, twobit); }
    void write_4bit(address_t const &receiver, uint8_t fourbit) { send_4bit(receiver, KNX_CT_WRITE, fourbit); }
    void write_1byte_int(address_t const &receiver, int8_t val) { send_1byte_int(receiver, KNX_CT_WRITE, val); }
    void write_1byte_uint(address_t const &receiver, uint8_t val) { send_1byte_uint(receiver, KNX_CT_WRITE, val); }
    void write_2byte_int(address_t const &receiver, int16_t val) { send_2byte_int(receiver, KNX_CT_WRITE, val); }
    void write_2byte_uint(address_t const &receiver, uint16_t val) { send_2byte_uint(receiver, KNX_CT_WRITE, val); }
    void write_2byte_float(address_t const &receiver, float val) { send_2byte_float(receiver, KNX_CT_WRITE, val); }
    void write_3byte_time(address_t const &receiver, uint8_t weekday, uint8_t hours, uint8_t minutes, uint8_t seconds) { send_3byte_time(receiver, KNX_CT_WRITE, weekday, hours, minutes, seconds); }
    void write_3byte_time(address_t const &receiver, time_of_day_t const &time) { send_3byte_time(receiver, KNX_CT_WRITE, time.weekday, time.hours, time.minutes, time.seconds); }
    void write_3byte_date(address_t const &receiver, uint8_t day, uint8_t month, uint8_t year) { send_3byte_date(receiver, KNX_CT_WRITE, day, month, year); }
    void write_3byte_date(address_t const &receiver, date_t const &date) { send_3byte_date(receiver, KNX_CT_WRITE, date.day, date.month, date.year); }
    void write_3byte_color(address_t const &receiver, uint8_t red, uint8_t green, uint8_t blue) { send_3byte_color(receiver, KNX_CT_WRITE, red, green, blue); }
    void write_3byte_color(address_t const &receiver, color_t const &color) { send_3byte_color(receiver, KNX_CT_WRITE, color); }
    void write_4byte_int(address_t const &receiver, int32_t val) { send_4byte_int(receiver, KNX_CT_WRITE, val); }
    void write_4byte_uint(address_t const &receiver, uint32_t val) { send_4byte_uint(receiver, KNX_CT_WRITE, val); }
    void write_4byte_float(address_t const &receiver, float val) { send_4byte_float(receiver, KNX_CT_WRITE, val); }
    void write_14byte_string(address_t const &receiver, const char *val) { send_14byte_string(receiver, KNX_CT_WRITE, val); }

    void answer_1bit(address_t const &receiver, uint8_t bit) { send_1bit(receiver, KNX_CT_ANSWER, bit); }
    void answer_2bit(address_t const &receiver, uint8_t twobit) { send_2bit(receiver, KNX_CT_ANSWER, twobit); }
    void answer_4bit(address_t const &receiver, uint8_t fourbit) { send_4bit(receiver, KNX_CT_ANSWER, fourbit); }
    void answer_1byte_int(address_t const &receiver, int8_t val) { send_1byte_int(receiver, KNX_CT_ANSWER, val); }
    void answer_1byte_uint(address_t const &receiver, uint8_t val) { send_1byte_uint(receiver, KNX_CT_ANSWER, val); }
    void answer_2byte_int(address_t const &receiver, int16_t val) { send_2byte_int(receiver, KNX_CT_ANSWER, val); }
    void answer_2byte_uint(address_t const &receiver, uint16_t val) { send_2byte_uint(receiver, KNX_CT_ANSWER, val); }
    void answer_2byte_float(address_t const &receiver, float val) { send_2byte_float(receiver, KNX_CT_ANSWER, val); }
    void answer_3byte_time(address_t const &receiver, uint8_t weekday, uint8_t hours, uint8_t minutes, uint8_t seconds) { send_3byte_time(receiver, KNX_CT_ANSWER, weekday, hours, minutes, seconds); }
    void answer_3byte_time(address_t const &receiver, time_of_day_t const &time) { send_3byte_time(receiver, KNX_CT_ANSWER, time.weekday, time.hours, time.minutes, time.seconds); }
    void answer_3byte_date(address_t const &receiver, uint8_t day, uint8_t month, uint8_t year) { send_3byte_date(receiver, KNX_CT_ANSWER, day, month, year); }
    void answer_3byte_date(address_t const &receiver, date_t const &date) { send_3byte_date(receiver, KNX_CT_ANSWER, date.day, date.month, date.year); }
    void answer_3byte_color(address_t const &receiver, uint8_t red, uint8_t green, uint8_t blue) { send_3byte_color(receiver, KNX_CT_ANSWER, red, green, blue); }
    void answer_3byte_color(address_t const &receiver, color_t const &color) { send_3byte_color(receiver, KNX_CT_ANSWER, color); }
    void answer_4byte_int(address_t const &receiver, int32_t val) { send_4byte_int(receiver, KNX_CT_ANSWER, val); }
    void answer_4byte_uint(address_t const &receiver, uint32_t val) { send_4byte_uint(receiver, KNX_CT_ANSWER, val); }
    void answer_4byte_float(address_t const &receiver, float val) { send_4byte_float(receiver, KNX_CT_ANSWER, val);}
    void answer_14byte_string(address_t const &receiver, const char *val) { send_14byte_string(receiver, KNX_CT_ANSWER, val); }

    bool          data_to_bool(uint8_t *data);
    int8_t        data_to_1byte_int(uint8_t *data);
    uint8_t       data_to_1byte_uint(uint8_t *data);
    int16_t       data_to_2byte_int(uint8_t *data);
    uint16_t      data_to_2byte_uint(uint8_t *data);
    float         data_to_2byte_float(uint8_t *data);
    color_t       data_to_3byte_color(uint8_t *data);
    time_of_day_t data_to_3byte_time(uint8_t *data);
    date_t        data_to_3byte_data(uint8_t *data);
    date_t        data_to_3byte_date(uint8_t *data) { return data_to_3byte_data(data); }
    int32_t       data_to_4byte_int(uint8_t *data);
    uint32_t      data_to_4byte_uint(uint8_t *data);
    float         data_to_4byte_float(uint8_t *data);

    static address_t GA_to_address(uint8_t area, uint8_t line, uint8_t member)
    {
      address_t tmp = {};
      tmp.bytes.high = uint8_t(((area & 31) << 3) | (line & 7));
      tmp.bytes.low = member;
      return tmp;
    }

    static address_t PA_to_address(uint8_t area, uint8_t line, uint8_t member)
    {
      address_t tmp = {};
      tmp.bytes.high = uint8_t(((area & 15) << 4) | (line & 15));
      tmp.bytes.low = member;
      return tmp;
    }

