betamoojw/ESP32_KNX_IP_Lib/esp-knx-ip.h
  private:
    void __loop_knx();
    void __dispatch(const knxip::CemiView &frame);
    void __loop_discovery();
    void __routing_decay(uint32_t now);
    static bool __transmit(const knxip::Endpoint &, const uint8_t *, size_t, void *);
    static void __clear_udp(KnxUDP &socket);
    knxip::Result __discovery_request(uint16_t service, IPAddress server, uint16_t port, uint16_t local_port, discovery_callback_t callback, void *arg);

    // Webserver functions
    void __loop_webserver();
    void __handle_root();
    void __handle_register();
    void __handle_delete();
    void __handle_set();
#if !DISABLE_EEPROM_BUTTONS
    void __handle_eeprom();
#endif
    void __handle_config();
    void __handle_feedback();
#if !DISABLE_RESTORE_BUTTONS
    void __handle_restore();
#endif
#if !DISABLE_REBOOT_BUTTONS
    void __handle_reboot();
#endif

    void __config_set_flags(config_id_t id, config_flags_t flags);

    void __config_set_string(config_id_t id, String &val);
    void __config_set_int(config_id_t id, int32_t val);
    void __config_set_bool(config_id_t id, bool val);
    void __config_set_options(config_id_t id, uint8_t val);
    void __config_set_ga(config_id_t id, address_t const &val);

    callback_assignment_id_t __callback_register_assignment(address_t address, callback_id_t id);
    void __callback_delete_assignment(callback_assignment_id_t id);

    address_t physaddr;
    KnxUDP udp;
    KnxUDP discovery_udp;
    knxip::Tunnel tunnel;
    bool routing_ = false;
    uint16_t local_port_ = 0;
    knxip::Result last_result_ = knxip::Result::NotConnected;
    Diagnostics diagnostics_ = {};
    uint32_t routing_wait_start_ = 0, routing_wait_ms_ = 0, routing_last_send_ = 0;
    bool routing_sent_ = false;
    uint32_t routing_busy_at_ = 0, routing_decay_at_ = 0;
    uint16_t routing_busy_factor_ = 0;
    discovery_callback_t discovery_callback_ = nullptr;
    void *discovery_arg_ = nullptr;
    uint32_t discovery_since_ = 0;
    uint16_t discovery_service_ = 0;
    uint16_t discovery_port_ = 0;
    knxip::Endpoint discovery_peer_ = {};

    callback_assignment_id_t registered_callback_assignments;
    callback_assignment_t callback_assignments[MAX_CALLBACK_ASSIGNMENTS];

    callback_id_t registered_callbacks;
    callback_t callbacks[MAX_CALLBACKS];

    config_id_t registered_configs;
    uint8_t custom_config_data[MAX_CONFIG_SPACE];
    uint8_t custom_config_default_data[MAX_CONFIG_SPACE];
    config_t custom_configs[MAX_CONFIGS];

    feedback_id_t registered_feedbacks;
    feedback_t feedbacks[MAX_FEEDBACKS];

    uint16_t __ntohs(uint16_t);
};

// Global "singleton" object
extern ESPKNXIP knx;

#endif

